describe('반복 유형 선택', () => {
  it('일정 생성 시 반복 유형을 선택할 수 있다.(매일) 2025-05-20 매일 반복되는 일정을 생성한다.', () => {});
  it('일정 생성 시 반복 유형을 선택할 수 있다.(매주) 2025-05-20 매주 반복되는 일정을 생성한다.', () => {});
  it('일정 생성 시 반복 유형을 선택할 수 있다.(매월) 2025-05-20 매월 반복되는 일정을 생성한다.', () => {});
  it('일정 생성 시 반복 유형을 선택할 수 있다.(매년) 2025-05-20 매년 반복되는 일정을 생성한다.', () => {});
  it('일정 수정 시 반복 유형을 선택할 수 있다. 2025-05-20 일정 생성 후, 매주 반복되는 일정으로 수정 한다.', () => {});
  it('2024-02-29일에 매년 반복일정을 생성한다. 2028-02-29일, 2032-02-29일에 반복일정이 생성된다. (4년마다 일정 반복)', () => {});
});

describe('반복 간격 설정', () => {
  it('일정 생성 시 반복 유형에 대해 간격을 설정할 수 있다.(2일마다)', () => {});
  it('일정 수정 시 반복 유형에 대해 간격을 설정할 수 있다.(3개월마다)', () => {});
});

describe('반복 일정표시, 단일 수정 및 단일 삭제', () => {
  it('반복 일정 표시, 캘린더 뷰에서 반복 일정을 시각적으로 표시한다.', () => {});
  it('반복 종료, 특정 날짜까지, 특정 횟수만큼까지 반복한다.', () => {});
  it('반복 일정 단일 수정, 반복일정을 수정하면 단일 일정으로 변경됩니다.', () => {});
  it('반복 일정 단일 삭제, 반복일정을 삭제하면 해당 일정만 삭헤합니다.', () => {});
});
