describe('repeat', () => {
  describe('반복 유형 선택', () => {
    it('일정 생성 시 반복 유형을 선택할 수 있다.', () => {});
    it('일정 수정 시  반복 유형을 선택할 수 있다.', () => {});
  });

  describe('반복 간격 설정', () => {
    it('각 반복 유형에 대해 간격을 설정할 수 있다.', () => {});
  });

  describe('반복 일정 표시', () => {
    it('캘린더 뷰에서 반복 일정을 시각적으로 구분하여 표시한다.', () => {});
  });

  describe('반복 종료', () => {
    it('특정 날짜까지를 지정할 수 있다.', () => {});
    it('특정 횟수만큼을 지정할 수 있다.', () => {});
    it('종료 없음을 지정할 수 있다.', () => {});
  });

  describe('반복 일정 단일 수정', () => {
    it('반복 일정 중 특정 날짜를 수정하면 단일 일정으로 변경된다.', () => {});
  });

  describe('반복 일정 단일 삭제', () => {
    it('반복일정을 삭제하면 해당 일정만 삭제합니다.', () => {});
  });
});
