describe('repeatUtils를 테스트합니다.', () => {
  describe('반복 유형 선택', () => {
    it('일정 생성 또는 수정 시 반복 유형을 선택할 수 있다.', () => {});

    it('1월 31일로 반복 설정 시 2월에는 28,29일로 설정이 된다.', () => {});
  });

  describe('반복 간격 설정', () => {
    it('2일 마다 반복되는 daily 일정을 설정한다.', () => {});
  });

  describe('반복 일정 표시', () => {
    it('반복 일정은 색이 다르게 표시된다.', () => {});
  });

  describe('반복 종료', () => {
    it('지정된 interval 횟수만큼만 반복한다', () => {});

    it('시작 날부터 endDate 까지만 반복한다.', () => {});
  });

  describe('반복 일정 단일 수정', () => {
    it('반복 일정을 수정하면 단일 일정으로 변경된다.', () => {});
  });

  describe('반복 일정 단일 삭제', () => {
    it('반복일정을 삭제하면 해당 일정만 삭제한다.', () => {});
  });
});
